Week7/w7d2/skeleton2/app/controllers/pokemon_controller.rb

INSERT INTO "pokemons" ("image_url", "attack", "defense", "name", "poke_type", "moves", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save

SELECT "pokemons".* FROM "pokemons"  ORDER BY "pokemons"."id" ASC
---
  def index
    @pokemon = Pokemon.all.order(:id)